Revit 2027 API
View.IsTemplate Property
Test whether the view is a view template.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsTemplate { get; }
Public ReadOnly Property IsTemplate As Boolean
	Get
public:
property bool IsTemplate {
	bool get ();
}
member IsTemplate : bool with get
Property Value
Boolean
See Also
Reference
View Class
Autodesk.Revit.DB Namespace